In [12]:
import pandas as pd

In [13]:
df = pd.DataFrame({
    "roll": [1, 2, 3, 4, 5, None, 7],
    "age": [20, 21, None, 22, 20, 21, 23],
    "chol": [200, None, 180, 190, None, 210, 220],
    "fbs": [85, 90, None, 70, 75, None, 95]
})

In [14]:
df

   roll   age   chol   fbs
0   1.0  20.0  200.0  85.0
1   2.0  21.0    NaN  90.0
2   3.0   NaN  180.0   NaN
3   4.0  22.0  190.0  70.0
4   5.0  20.0    NaN  75.0
5   NaN  21.0  210.0   NaN
6   7.0  23.0  220.0  95.0

In [15]:
df.describe()

           roll        age        chol        fbs
count  6.000000   6.000000    5.000000   5.000000
mean   3.666667  21.166667  200.000000  83.000000
std    2.160247   1.169045   15.811388  10.368221
min    1.000000  20.000000  180.000000  70.000000
25%    2.250000  20.250000  190.000000  75.000000
50%    3.500000  21.000000  200.000000  85.000000
75%    4.750000  21.750000  210.000000  90.000000
max    7.000000  23.000000  220.000000  95.000000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    6 non-null      float64
 1   age     6 non-null      float64
 2   chol    5 non-null      float64
 3   fbs     5 non-null      float64
dtypes: float64(4)
memory usage: 352.0 bytes

In [17]:
df.isnull().sum()

roll    1
age     1
chol    2
fbs     2
dtype: int64

In [18]:
df.dtypes

roll    float64
age     float64
chol    float64
fbs     float64
dtype: object

In [19]:
df.shape

(7, 4)

In [20]:
df1 = df.fillna("n")
df1

  roll   age   chol   fbs
0  1.0  20.0  200.0  85.0
1  2.0  21.0      n  90.0
2  3.0     n  180.0     n
3  4.0  22.0  190.0  70.0
4  5.0  20.0      n  75.0
5    n  21.0  210.0     n
6  7.0  23.0  220.0  95.0

In [21]:
df2 = df.fillna(5)
df2

   roll   age   chol   fbs
0   1.0  20.0  200.0  85.0
1   2.0  21.0    5.0  90.0
2   3.0   5.0  180.0   5.0
3   4.0  22.0  190.0  70.0
4   5.0  20.0    5.0  75.0
5   5.0  21.0  210.0   5.0
6   7.0  23.0  220.0  95.0

In [22]:
df1 = df.fillna({'chol':1,'fbs':2})
df1.isnull().sum()
df1

   roll   age   chol   fbs
0   1.0  20.0  200.0  85.0
1   2.0  21.0    1.0  90.0
2   3.0   NaN  180.0   2.0
3   4.0  22.0  190.0  70.0
4   5.0  20.0    1.0  75.0
5   NaN  21.0  210.0   2.0
6   7.0  23.0  220.0  95.0

In [23]:
df1 = df.ffill()
df1

   roll   age   chol   fbs
0   1.0  20.0  200.0  85.0
1   2.0  21.0  200.0  90.0
2   3.0  21.0  180.0  90.0
3   4.0  22.0  190.0  70.0
4   5.0  20.0  190.0  75.0
5   5.0  21.0  210.0  75.0
6   7.0  23.0  220.0  95.0

In [24]:
df1 = df.bfill()
df1

   roll   age   chol   fbs
0   1.0  20.0  200.0  85.0
1   2.0  21.0  180.0  90.0
2   3.0  22.0  180.0  70.0
3   4.0  22.0  190.0  70.0
4   5.0  20.0  210.0  75.0
5   7.0  21.0  210.0  95.0
6   7.0  23.0  220.0  95.0

In [25]:
df1 = df.interpolate()
df1

   roll   age   chol   fbs
0   1.0  20.0  200.0  85.0
1   2.0  21.0  190.0  90.0
2   3.0  21.5  180.0  80.0
3   4.0  22.0  190.0  70.0
4   5.0  20.0  200.0  75.0
5   6.0  21.0  210.0  85.0
6   7.0  23.0  220.0  95.0

In [26]:
df1 = df.dropna()
df1

   roll   age   chol   fbs
0   1.0  20.0  200.0  85.0
3   4.0  22.0  190.0  70.0
6   7.0  23.0  220.0  95.0